CREATE OR REPLACE PACKAGE        EX$SEC_CATALOG_API
AS
   /*
   **  $Header EX$SEC_CATALOG_API:SPECIFICATION version[0.4] $
   **  $Documentation View developer manual $
   */

   -------------------------------------------------------------------------------
   -- Public types 
   -------------------------------------------------------------------------------

   -------------------------------------------------------------------------------
   -- Public exceptions
   -------------------------------------------------------------------------------

   -------------------------------------------------------------------------------
   -- Public constants
   -------------------------------------------------------------------------------

   -------------------------------------------------------------------------------       
   -- Public variables
   -------------------------------------------------------------------------------

    
   -------------------------------------------------------------------------------   
   -- Public functions declarations 
   -------------------------------------------------------------------------------
   -------------------------------------------------------------------------------
   -- PROCEDURE: INITIALIZE
   --
   -- PURPOSE:
   -- Инициализация пакета.
   --
   -- PARAMETERS:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE INITIALIZE;

   -------------------------------------------------------------------------------
   -- FUNCTION: GET_VERSION
   --
   -- PURPOSE:
   -- Версия пакета
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   FUNCTION GET_VERSION
      RETURN VARCHAR2;

   -------------------------------------------------------------------------------
   -- FUNCTION: GET_MNAME
   --
   -- PURPOSE:
   -- Имя пакета/модуля
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   FUNCTION GET_MNAME
      RETURN VARCHAR2;

   -------------------------------------------------------------------------------
   -- PROCEDURE: CATALOG_REGISTER
   --
   -- PURPOSE:
   -- Регистрация нового каталога в репозитории
   -- 
   -- PARAMETERS:
   --   P_CATALOG
   --       Уникальное пользовательское имя целевой системы в репозитории.
   --
   --   P_TYPE
   --       Тип целевой системы. Смотри EX$SEC_CATALOG_TYPE.
   --
   --   P_CONNECTION
   --       Маска строки подключения к целевой системе. Примеры форматов:
   --       ORA:TNSNAME:"MYDBSNAME"
   --       ORA:DBSLINK:"MYDBSLINK"
   --       ORA:DESCRPTION:""
   --
   --   P_TARGET
   --       Уникальное имя конфигурационной единицы, к которой привязана
   --       целевая система.  
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE CATALOG_REGISTER(P_CATALOG    IN VARCHAR2
                             ,P_TYPE       IN VARCHAR2 DEFAULT NULL
                             ,P_CONNECTION IN VARCHAR2 DEFAULT NULL
                             ,P_TARGET     IN VARCHAR2 DEFAULT NULL);

   -------------------------------------------------------------------------------
   -- PROCEDURE: CATALOG_UNREGISTER
   --
   -- PURPOSE:
   -- Помечает целевую систему как незарегистрированную. По сути логическое  
   -- удаление целевой системы.
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE CATALOG_UNREGISTER(P_CATALOG      IN VARCHAR2
                               ,P_PURGE_POLICY IN BOOLEAN DEFAULT FALSE);
                       
   -------------------------------------------------------------------------------
   -- PROCEDURE: AGENT_DEPLOY
   --
   -- PURPOSE:
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE AGENT_DEPLOY(P_CATALOG   IN VARCHAR2
                         ,P_VERSION   IN VARCHAR2 DEFAULT NULL
                         ,P_ISWAIT    IN BOOLEAN DEFAULT TRUE 
                         ,P_ISREPLACE IN BOOLEAN DEFAULT FALSE);
                         
   -------------------------------------------------------------------------------
   -- FUNCTION: CATALOG_APPROVED
   --
   -- PURPOSE:
   -- Проводит необходимые проверки интерфейсных функций и заполняет необходивы 
   -- для запуска каталога параметры.
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   FUNCTION CATALOG_APPROVED(P_CATALOG IN VARCHAR2)
   RETURN NUMBER;      

   -------------------------------------------------------------------------------
   -- PROCEDURE: CATALOG_START
   --
   -- PURPOSE:
   -- Запускает все опции для каталога (целевой системы): 
   --       1. Прием изменений от целевой системы
   --       2. Применение изменение в репозиторий
   --       3. Срабатывание политик по каталогу
   --       4. Создание операций по срабатывающим политикам
   --       5. Отправка операций по срабатывающим политикам в целевую систему
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE CATALOG_START(P_CATALOG IN VARCHAR2);

   -------------------------------------------------------------------------------
   -- PROCEDURE: CATALOG_PAUSE
   --
   -- PURPOSE:
   -- Выключает часть опций для каталога (целевой системы): 
   -- (+) - опция остаётся включенной 
   -- (-) - опция выключается
   --       1. Прием изменений от целевой системы (+)
   --       2. Применение изменение в репозиторий (-)
   --       3. Срабатывание политик по каталогу   (+)
   --       4. Создание операций по срабатывающим политикам (+)
   --       5. Отправка операций по срабатывающим политикам в целевую систему (-)
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE CATALOG_PAUSE(P_CATALOG     IN VARCHAR2);

   -------------------------------------------------------------------------------
   -- PROCEDURE: CATALOG_STOP
   --
   -- PURPOSE:
   -- Выключает все опции для каталога (целевой системы): 
   -- (+) - опция остаётся включенной 
   -- (-) - опция выключается
   --       1. Прием изменений от целевой системы (-)
   --       2. Применение изменение в репозиторий (-)
   --       3. Срабатывание политик по каталогу   (-)
   --       4. Создание операций по срабатывающим политикам (-)
   --       5. Отправка операций по срабатывающим политикам в целевую систему (-)
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE CATALOG_STOP(P_CATALOG     IN VARCHAR2
                         ,P_STOP_AGENT  IN BOOLEAN DEFAULT TRUE);

   -------------------------------------------------------------------------------
   -- PROCEDURE: AGENT_START
   --
   -- PURPOSE:
   -- Запускает агента на стороне целевой системы. 
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE AGENT_START(P_CATALOG IN VARCHAR2);
   
   -------------------------------------------------------------------------------
   -- PROCEDURE: AGENT_STOP
   --
   -- PURPOSE:
   -- Останавливает агента на стороне целевой системы. 
   -- При этом все опции остаются включены.
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE AGENT_STOP(P_CATALOG IN VARCHAR2);
   
   -------------------------------------------------------------------------------
   -- PROCEDURE: SET_PARAMETER
   --
   -- PURPOSE:
   -- Изменяет значения отдельных опций целевой системы
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE SET_PARAMETER(P_CATALOG IN VARCHAR2
                       ,P_NAME    IN VARCHAR2  
                       ,P_VALUE   IN VARCHAR2);                           

   -------------------------------------------------------------------------------
   -- PROCEDURE: RESET_PARAMETER
   --
   -- PURPOSE:
   -- Сбрасывает значения отдельных опций целевой системы на значение по умолчанию
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   PROCEDURE RESET_PARAMETER(P_CATALOG IN VARCHAR2
                         ,P_NAME    IN VARCHAR2);

   -------------------------------------------------------------------------------
   -- FUNCTION: GET_PARAMETER
   --
   -- PURPOSE:
   -- Возвращает значения отдельных опций целевой системы
   --
   -- PARAMETERS:
   --
   -- RETURN:
   --
   -- EXCEPTIONS:
   --
   -- NOTE:
   --
   -------------------------------------------------------------------------------
   FUNCTION GET_PARAMETER(P_CATALOG IN VARCHAR2
                       ,P_NAME    IN VARCHAR2  
                       ,P_VALUE   IN VARCHAR2)
   RETURN NUMBER;
   
--------------------------------------------------------------------------------


END EX$SEC_CATALOG_API;
/
